dataPairs = {
    // базові налаштування пар, що задаються біржею Exmo
    
    "crPairs":                ['BTC_USD',   'XRP_BTC', 'DASH_BTC'],  //пари з якими працюємо
    "crMain":                 ['BTC',       'XRP',     'DASH'],      //головная валюта пари
    "crSub":                  ['USD',       'BTC',     'BTC'],       //підлегла валюта пари
    "mainBalance":            [0,           0,          0],          //баланс головної валюти
    "subBalance":             [0,           0,          0],          //баланс підлеглої валюти
    "crMinQuant":             [0.00002,     1,          0.01],       //мінімальний обем для операції 
    "crMaxQuant":             [1000,        5000000,    10000],      //максимальний обєм операції
    "crMinPrise":             [1,           0.0000001,  0.0001],     //мінімальная ціна
    "crMaxPrise":             [150000,      1,          1],          //максимальная ціна
    "crMinSum":               [1,           0.00001,    0.001],      //мінімальная сума операції
    "crMaxSum":               [500000,      100,        100],        //максимальная сума операції
    "crPrisePrec":            [2,           8,          8],          //точність ціни - кількість знаків після клми
    

    // налаштування алгоритму Базово-граничного аналізу

    "lastBaseCost":           [0,           0,          0],          //остання базова ціна
    
    "buyBorder":              [-1.7,       -1.4,      -2.5],        //границі закупки
    "sellBorder":             [ 1.6,        1.2,       2.4],        //границі продажу

    // проміжні значення об'єкту, які використовуються у процесі роботи алгоритмів
    
    "baseTradeDecision":      ['noComm',    'noComm',   'noComm'],   //торгове рішення за базовим алгоритмом 
    "lastExCommand":          ['noComm',    'noComm',   'noComm'],   //остання Екстра команда базового алгоритму 
    
    "nowCost":                [0,           0,          0],          //поточна ціна

    "crTrades":               [[                                ]],  //останні 100 операцій по парі
    
    "crLastTradesType":       ['',          '',         ''],         //тип останнього ордеру 
    "crLastTradesPrice":      [0,           0,          0],          //ціна останнього ордеру
    "crLastTradesQuantity":   [0,           0,          0],          //обем останнього ордеру
    
    "crPrLastTradesType":     ['',          '',         ''],         //тип передостаннього ордеру 
    "crPrLastTradesPrice":    [0,           0,          0],          //ціна передостаннього ордеру
    "crPrLastTradesQuantity": [0,           0,          0],          //обем передостаннього ордеру
    
    "crSellFrom100":          [[                                ]],  //дані Sell зі 100 
    "crBuyFrom100":           [[                                ]],  //дані Buy зі 100
    "crPriceSellMax":         [                                  ],  //значення Макс ціни продажу
    "crPriceBuyMin":          [                                  ],  //значення Мін ціни закупки
    
    "rsi":                    [0,           0,          0],          //значення индексу rsi
    "rsi120":                 [0,           0,          0],          //значення индексу rsi120
    "rsiTrend":               ['noTrend',   'noTrend',  'noTrend'],  //тренд за rsi
    "rsiDivergention":        ['no',        'no',       'no'],       //дивергенція за rsi
    "rsi120Divergention":     ['no',        'no',       'no'],       //дивергенція за rsi120    
    "rsiCommand":             ['noComm',    'noComm',   'noComm']    //команда продажу за індексом rsi
};     